Revit 2024 API
SpacingRule.Justification Property
The justification of the lines within the region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public SpacingRuleJustification Justification { get; set; }
Visual Basic
Public Property Justification As SpacingRuleJustification
	Get
	Set
Visual C++
public:
property SpacingRuleJustification Justification {
	SpacingRuleJustification get ();
	void set (SpacingRuleJustification value);
}
Remarks
This property is only available when Layout is equal to FixedDistance, FixedNumber, MaximumSpacing, or MinimumSpacing.
See Also
SpacingRule Class
Autodesk.Revit.DB Namespace